;******************************************************************************
;* MSP430 C/C++ Codegen                                           Unix v4.4.3 *
;* Date/Time created: Tue Jul 14 19:39:35 2015                                *
;******************************************************************************
	.compiler_opts --abi=eabi --diag_wrap=off --hll_source=on --mem_model:code=large --mem_model:data=large --object_format=elf --silicon_errata=CPU21 --silicon_errata=CPU22 --silicon_errata=CPU23 --silicon_errata=CPU40 --silicon_version=mspx --symdebug:dwarf --symdebug:dwarf_version=3 

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../driverlib/MSP430F5xx_6xx/timer_b.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI MSP430 C/C++ Codegen Unix v4.4.3 Copyright (c) 2003-2015 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/home/iross/msp430-experiments/clock-experiment/Debug")
;	/opt/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/bin/opt430 /tmp/091746QeMSB /tmp/09174LZ5Gqu 
	.sect	".text:Timer_B_startCounter"
	.clink
	.global	Timer_B_startCounter

$C$DW$1	.dwtag  DW_TAG_subprogram, DW_AT_name("Timer_B_startCounter")
	.dwattr $C$DW$1, DW_AT_low_pc(Timer_B_startCounter)
	.dwattr $C$DW$1, DW_AT_high_pc(0x00)
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("Timer_B_startCounter")
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_TI_begin_file("../driverlib/MSP430F5xx_6xx/timer_b.c")

;*****************************************************************************
;* FUNCTION NAME: Timer_B_getCounterValue                                    *
;*                                                                           *
;*   Regs Modified     : SP,SR,r12,r13,r14,r15                               *
;*   Regs Used         : SP,SR,r12,r13,r14,r15                               *
;*   Local Frame Size  : 0 Args + 0 Auto + 0 Save = 0 byte                   *
;*****************************************************************************
Timer_B_getCounterValue:
;* --------------------------------------------------------------------------*
	.dwcfi	cfa_offset, 4
	.dwcfi	save_reg_to_mem, 16, -4
;* r12   assigned to baseAddress
$C$DW$142	.dwtag  DW_TAG_variable, DW_AT_name("baseAddress")
	.dwattr $C$DW$142, DW_AT_TI_symbol_name("baseAddress")
	.dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$142, DW_AT_location[DW_OP_reg12]
;* r14   assigned to voteOne
$C$DW$143	.dwtag  DW_TAG_variable, DW_AT_name("voteOne")
	.dwattr $C$DW$143, DW_AT_TI_symbol_name("voteOne")
	.dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$143, DW_AT_location[DW_OP_reg14]
;* r15   assigned to voteTwo
$C$DW$144	.dwtag  DW_TAG_variable, DW_AT_name("voteTwo")
	.dwattr $C$DW$144, DW_AT_TI_symbol_name("voteTwo")
	.dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$144, DW_AT_location[DW_OP_reg15]
;* r14   assigned to res
$C$DW$145	.dwtag  DW_TAG_variable, DW_AT_name("res")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("res")
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$145, DW_AT_location[DW_OP_reg14]
	.dwpsn	file "../driverlib/MSP430F5xx_6xx/timer_b.c",line 370,column 5,is_stmt,isa 0
        MOVA      r12,r15               ; [] |370| 
        ADD.W     #16,r15               ; [] |370| 
        MOV.W     @r15,r15              ; [] |370| 
;* --------------------------------------------------------------------------*
;*   BEGIN LOOP $C$L11
;*
;*   Loop source line                : 372
;*   Loop closing brace source line  : 389
;*   Known Minimum Trip Count        : 1
;*   Known Maximum Trip Count        : 4294967295
;*   Known Max Trip Count Factor     : 1
;* --------------------------------------------------------------------------*
$C$L11:    
	.dwpsn	file "../driverlib/MSP430F5xx_6xx/timer_b.c",line 374,column 9,is_stmt,isa 0
        MOVA      r15,r14               ; [] |374| 
	.dwpsn	file "../driverlib/MSP430F5xx_6xx/timer_b.c",line 375,column 9,is_stmt,isa 0
        MOVA      r12,r15               ; [] |375| 
        ADD.W     #16,r15               ; [] |375| 
        MOV.W     @r15,r15              ; [] |375| 
	.dwpsn	file "../driverlib/MSP430F5xx_6xx/timer_b.c",line 379,column 13,is_stmt,isa 0
        CMP.W     r15,r14               ; [] |379| 
        JHS       $C$L12                ; [] |379| 
                                          ; [] |379| 
;* --------------------------------------------------------------------------*
        MOVA      r15,r13               ; [] |379| 
        SUB.W     r14,r13               ; [] |379| 
        MOVA      r13,r14               ; [] |379| 
        JMP       $C$L14                ; [] |379| 
                                          ; [] |379| 
;* --------------------------------------------------------------------------*
$C$L12:    
        CMP.W     r14,r15               ; [] |379| 
        JHS       $C$L13                ; [] |379| 
                                          ; [] |379| 
;* --------------------------------------------------------------------------*
        SUB.W     r15,r14               ; [] |379| 
        JMP       $C$L14                ; [] |379| 
                                          ; [] |379| 
;* --------------------------------------------------------------------------*
$C$L13:    
        MOV.W     #0,r14                ; [] |379| 
;* --------------------------------------------------------------------------*
$C$L14:    
	.dwpsn	file "../driverlib/MSP430F5xx_6xx/timer_b.c",line 390,column 11,is_stmt,isa 0
        CMP.W     #51,r14               ; [] |390| 
        JHS       $C$L11                ; [] |390| 
                                          ; [] |390| 
;* --------------------------------------------------------------------------*
	.dwpsn	file "../driverlib/MSP430F5xx_6xx/timer_b.c",line 392,column 5,is_stmt,isa 0
        MOVA      r15,r12               ; [] |392| 
	.dwpsn	file "../driverlib/MSP430F5xx_6xx/timer_b.c",line 393,column 1,is_stmt,isa 0
$C$DW$146	.dwtag  DW_TAG_TI_branch
	.dwattr $C$DW$146, DW_AT_low_pc(0x00)
	.dwattr $C$DW$146, DW_AT_TI_return
        RETA      ; [] 
        ; [] 
	.dwattr $C$DW$140, DW_AT_TI_end_file("../driverlib/MSP430F5xx_6xx/timer_b.c")
	.dwattr $C$DW$140, DW_AT_TI_end_line(0x189)
	.dwattr $C$DW$140, DW_AT_TI_end_column(0x01)
	.dwendentry
	.dwendtag $C$DW$140


;******************************************************************************
;* BUILD ATTRIBUTES                                                           *
;******************************************************************************
	.battr "TI", Tag_File, 1, Tag_LPM_INFO(1)
	.battr "TI", Tag_File, 1, Tag_PORTS_INIT_INFO("012345678901ABCDEFGHIJ00000000000011110000000000000000000000000000")
	.battr "TI", Tag_File, 1, Tag_HW_MPY32_INFO(2)
	.battr "TI", Tag_File, 1, Tag_HW_MPY_ISR_INFO(1)
	.battr "TI", Tag_File, 1, Tag_HW_MPY_INLINE_INFO(1)
	.battr "mspabi", Tag_File, 1, Tag_enum_size(3)

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("Timer_B_initCaptureModeParam")
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$147, DW_AT_name("captureRegister")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("captureRegister")
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$147, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$147, DW_AT_decl_column(0x0e)
$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$148, DW_AT_name("captureMode")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("captureMode")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$148, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$148, DW_AT_decl_column(0x0e)
$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$149, DW_AT_name("captureInputSelect")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("captureInputSelect")
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$149, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$149, DW_AT_decl_column(0x0e)
$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$150, DW_AT_name("synchronizeCaptureSource")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("synchronizeCaptureSource")
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$150, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$150, DW_AT_decl_column(0x0e)
$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$151, DW_AT_name("captureInterruptEnable")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("captureInterruptEnable")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$151, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$151, DW_AT_decl_column(0x0e)
$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$152, DW_AT_name("captureOutputMode")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("captureOutputMode")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$152, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$152, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initCaptureModeParam")
	.dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$27, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x03)
$C$DW$T$28	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$28, DW_AT_address_class(0x14)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("Timer_B_initCompareModeParam")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x08)
$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$153, DW_AT_name("compareRegister")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("compareRegister")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$153, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x17a)
	.dwattr $C$DW$153, DW_AT_decl_column(0x0e)
$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$154, DW_AT_name("compareInterruptEnable")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("compareInterruptEnable")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$154, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x17f)
	.dwattr $C$DW$154, DW_AT_decl_column(0x0e)
$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$155, DW_AT_name("compareOutputMode")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("compareOutputMode")
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$155, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x18a)
	.dwattr $C$DW$155, DW_AT_decl_column(0x0e)
$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$156, DW_AT_name("compareValue")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("compareValue")
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$156, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x18c)
	.dwattr $C$DW$156, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x16e)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
$C$DW$T$30	.dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initCompareModeParam")
	.dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$30, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x18d)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x03)
$C$DW$T$31	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$31, DW_AT_address_class(0x14)

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_name("Timer_B_initContinuousModeParam")
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x0a)
$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$157, DW_AT_name("clockSource")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("clockSource")
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$157, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x105)
	.dwattr $C$DW$157, DW_AT_decl_column(0x0e)
$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$158, DW_AT_name("clockSourceDivider")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("clockSourceDivider")
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$158, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$158, DW_AT_decl_column(0x0e)
$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$159, DW_AT_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$159, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0x121)
	.dwattr $C$DW$159, DW_AT_decl_column(0x0e)
$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$160, DW_AT_name("timerClear")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("timerClear")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$160, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0x127)
	.dwattr $C$DW$160, DW_AT_decl_column(0x0e)
$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$161, DW_AT_name("startTimer")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("startTimer")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$161, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0x129)
	.dwattr $C$DW$161, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$23

	.dwattr $C$DW$T$23, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
$C$DW$T$33	.dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initContinuousModeParam")
	.dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$33, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x03)
$C$DW$T$34	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$34, DW_AT_address_class(0x14)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_name("Timer_B_initUpDownModeParam")
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$162, DW_AT_name("clockSource")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("clockSource")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$162, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0x13a)
	.dwattr $C$DW$162, DW_AT_decl_column(0x0e)
$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$163, DW_AT_name("clockSourceDivider")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("clockSourceDivider")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$163, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x151)
	.dwattr $C$DW$163, DW_AT_decl_column(0x0e)
$C$DW$164	.dwtag  DW_TAG_member
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$164, DW_AT_name("timerPeriod")
	.dwattr $C$DW$164, DW_AT_TI_symbol_name("timerPeriod")
	.dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$164, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$164, DW_AT_decl_line(0x153)
	.dwattr $C$DW$164, DW_AT_decl_column(0x0e)
$C$DW$165	.dwtag  DW_TAG_member
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$165, DW_AT_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$165, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$165, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$165, DW_AT_decl_line(0x158)
	.dwattr $C$DW$165, DW_AT_decl_column(0x0e)
$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$166, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x15d)
	.dwattr $C$DW$166, DW_AT_decl_column(0x0e)
$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$167, DW_AT_name("timerClear")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("timerClear")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x163)
	.dwattr $C$DW$167, DW_AT_decl_column(0x0e)
$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$168, DW_AT_name("startTimer")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("startTimer")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0x165)
	.dwattr $C$DW$168, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$24

	.dwattr $C$DW$T$24, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x132)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
$C$DW$T$36	.dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initUpDownModeParam")
	.dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$36, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x166)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x03)
$C$DW$T$37	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$37, DW_AT_address_class(0x14)

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_name("Timer_B_initUpModeParam")
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x0e)
$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$169, DW_AT_name("clockSource")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("clockSource")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0x90)
	.dwattr $C$DW$169, DW_AT_decl_column(0x0e)
$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$170, DW_AT_name("clockSourceDivider")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("clockSourceDivider")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$170, DW_AT_decl_column(0x0e)
$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$171, DW_AT_name("timerPeriod")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("timerPeriod")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0xaa)
	.dwattr $C$DW$171, DW_AT_decl_column(0x0e)
$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$172, DW_AT_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("timerInterruptEnable_TBIE")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0xaf)
	.dwattr $C$DW$172, DW_AT_decl_column(0x0e)
$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$173, DW_AT_name("captureCompareInterruptEnable_CCR0_CCIE")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("captureCompareInterruptEnable_CCR0_CCIE")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$173, DW_AT_decl_column(0x0e)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$174, DW_AT_name("timerClear")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("timerClear")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0xba)
	.dwattr $C$DW$174, DW_AT_decl_column(0x0e)
$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$175, DW_AT_name("startTimer")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("startTimer")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$175, DW_AT_decl_column(0x0a)
	.dwendtag $C$DW$T$25

	.dwattr $C$DW$T$25, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x88)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
$C$DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_initUpModeParam")
	.dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$39, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x03)
$C$DW$T$40	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$40, DW_AT_address_class(0x14)

$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_name("Timer_B_outputPWMParam")
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x0c)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$176, DW_AT_name("clockSource")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("clockSource")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$176, DW_AT_decl_column(0x0e)
$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$177, DW_AT_name("clockSourceDivider")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("clockSourceDivider")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x66)
	.dwattr $C$DW$177, DW_AT_decl_column(0x0e)
$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$178, DW_AT_name("timerPeriod")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("timerPeriod")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x68)
	.dwattr $C$DW$178, DW_AT_decl_column(0x0e)
$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$179, DW_AT_name("compareRegister")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("compareRegister")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x73)
	.dwattr $C$DW$179, DW_AT_decl_column(0x0e)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$180, DW_AT_name("compareOutputMode")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("compareOutputMode")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$180, DW_AT_decl_column(0x0e)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$181, DW_AT_name("dutyCycle")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("dutyCycle")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x80)
	.dwattr $C$DW$181, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$26

	.dwattr $C$DW$T$26, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x47)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
$C$DW$T$42	.dwtag  DW_TAG_typedef, DW_AT_name("Timer_B_outputPWMParam")
	.dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$42, DW_AT_decl_file("../driverlib/MSP430F5xx_6xx/timer_b.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x81)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x03)
$C$DW$T$43	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$43, DW_AT_address_class(0x14)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")

$C$DW$T$56	.dwtag  DW_TAG_subroutine_type
	.dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
$C$DW$T$57	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$57, DW_AT_address_class(0x14)
$C$DW$T$58	.dwtag  DW_TAG_typedef, DW_AT_name("__SFR_FARPTR")
	.dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$58, DW_AT_decl_file("/opt/ti/ccsv6/ccs_base/msp430/include/msp430f5529.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x47)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x11)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$59	.dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
	.dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$59, DW_AT_decl_file("/opt/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/include/stdint.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x1e)
$C$DW$T$60	.dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$60, DW_AT_decl_file("/opt/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/include/stdint.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x17)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$52, DW_AT_decl_file("/opt/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/include/stdint.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x1d)
$C$DW$T$65	.dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
	.dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$65, DW_AT_decl_file("/opt/ti/ccsv6/tools/compiler/ti-cgt-msp430_4.4.3/include/stdint.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x38)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x16)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
